from .Devanagari import *

IPAVowelMap = [
                  'अ॑',
                  'अ॒',

                  'अ᳚',
                  'आ॒',
                  'आ॑',
                  'आ᳚',

                  'इ॑',
                  'ॶ',

                  'उ॑',
                  'उ़',
                  'ऊ़',

                  'ऎ᳚',
                  'ऎ॑',
                  'ऎर्‍',
                  'एर्‍',

                  'आॕ',
                  'ऑ़',

                  'ऒ़',
                  'ओ़',
                  'ॵ़',
                  'औ़'
                  ]

NuktaConsonantMap =  [
                     'क़',
                     'ख़',
                     'ग़',
                     'ज़',
                     'ढ़',
                     'ढ़',
                     'फ़',
                     'य़'
                     ]

IPAVowelSignMap = [
                  '॑',
                  '॒',

                  '᳚',
                  'ा॒',
                  'ा॑',
                  'ा᳚',

                  'ि॑',
                  'ॖ',

                  'ु॑',
                  'ु़',
                  'ू़',

                  'ॆ᳚',
                  'ॆ॑',
                  'ॆर्‍',
                  'ेर्‍',

                  'ाॕ',
                  'ॉ़',

                  'ॊ़',
                  'ो़',
                  'ॏ़',
                  'ौ़'
                ]

IPAConsonantMap =[
                     'ट़',
                     'ठ़',
                     'ॾ',
                     'व़',
                     'व्फ़',
                     'त़',
                     'द़',
                     'ऱ',
                     'ॹ',
                     'ब़',
                     'ॺ',
                     'य़',
                     'ह्ऱ',
                     'ह़',
                     'श़'
                      ]