from .Kannada import *

ModernVowelMap = [
                 'ಆ್ಯ಼',
                 'ಆ॒॑',
                 ]

ModernVowelSignMap =[
                    '್ಯ಼ಾ',
                    'ಾ॒॑',
                    ]

IPAVowelMap = [
                  'ಅ॑',
                  'ಅ॒',

                  'ಅ᳚',
                  'ಆ॒',
                  'ಆ॑',
                  'ಆ᳚',

                  'ಇ॑',
                  'ಇ॒',

                  'ಉ॑',
                  'ಉ॒',
                  'ಊ॒',

                  'ಎ᳚',
                  'ಎ॑',
                  'ಅಽ',
                  'ಅಽಽ',

                  'ಆ॒᳚',
                  'ಅ॑᳚',

                  'ಒ॒',
                  'ಓ॒',
                  'ಒ॒॑',
                  'ಓ॒॑'
                  ]

NuktaConsonantMap =  [
                     'ಕ಼',
                     'ಖ಼',
                     'ಗ಼',
                     'ಜ಼',
                     'ಢ಼',
                     'ಢ಼',
                     'ಫ಼',
                     'ಯ಼'
                     ]

IPAVowelSignMap = [
                  '॑',
                  '॒',

                  '᳚',
                  'ಾ॒',
                  'ಾ॑',
                  'ಾ᳚',

                  'ಿ॑',
                  'ಿ॒',

                  'ು॑',
                  'ು॒',
                  'ೂ॒',

                  'ೆ᳚',
                  'ೆ॑',
                  'ಽ',
                  'ಽಽ',

                  'ಾ॒᳚',
                  'ಾ॑᳚',

                  'ೊ॒',
                  'ೋ॒',
                  'ೊ॒॑',
                  'ೋ॒॑'
                ]

IPAConsonantMap =[
                     'ಟ಼',
                     'ಠ಼',
                     'ಡ಼',
                     'ವ಼',
                     'ವ್ಫ಼',
                     'ತ಼',
                     'ದ಼',
                     'ರ಼',
                     'ಷ಼',
                     'ಬ಼',
                     'ಯ್ಜ',
                     'ಯ಼',
                     'ಹ್ರ಼',
                     'ಹ಼',
                     'ಶ಼'
                      ]