from .Malayalam import *

ModernVowelMap = [
                 'ഏ഼',
                 'ഓ഻',
                 ]

ModernVowelSignMap =[
                    'േ഼',
                    'ോ഻',
                    ]

IPAVowelMap = [
                  'അ഻',
                  'അഴ്\u0323',

                  'അ഻഼',
                  'ആ॒',
                  'ആ഻',
                  'ആ഻഼',

                  'ഇ഻',
                  'ഉ്',

                  'ഉ഻',
                  'ഉ॒',
                  'ഊ॒',

                  'എ഻഼',
                  'എ഻',
                  'അഽ',
                  'അഽഽ',

                  'ഓ഻഼',
                  'ഓ഼',

                  'ഒ॒',
                  'ഓ॒',
                  'ഒ഻॒',
                  'ഓ഻॒'
                  ]

NuktaConsonantMap =  [
                     'ക̣',
                     'ഖ̣',
                     'ഗ̣',
                     'ജ̣',
                     'ഢ̣',
                     'ഢ̣',
                     'ഫ̣',
                     'യ̣'
                     ]

IPAVowelSignMap = [
                  '഻',
                  'ഴ്\u0323',

                  '഻഼',
                  'ാ॒',
                  'ാ഻',
                  'ാ഻഼',

                  'ി഻',
                  'ു്',

                  'ു഻',
                  'ു॒',
                  'ൂ॒',

                  'െ഻഼',
                  'െ഻',
                  'ഽ',
                  'ഽഽ',

                  'ോ഻഼',
                  'ോ഼',

                  'ൊ॒',
                  'ോ॒',
                  'ൊ॒॑',
                  'ോ॒॑'
                ]

IPAConsonantMap =[
                     '\u0D3A',
                     'ഠ\u0323',
                     'ഡ̣',
                     'വ̣',
                     'വ്ഫ̣',
                     'ത̣',
                     'ദ̣',
                     'ര̣',
                     'ഷ̣',
                     'ബ\u0323',
                     'യ്ജ',
                     'യ̣',
                     'ഹ്ര\u0323',
                     'ഹ̣',
                     'ശ\u0323'
                      ]