from .Tamil import *

ModernVowelMap = [
                 'ஏ॑',
                 'ஆ॒॑',
                 ]

ModernVowelSignMap =[
                    'ே॑',
                    'ா॒॑',
                    ]

IPAVowelMap = [
                  'அ॑',
                  'அ॒',

                  'அ᳚',
                  'ஆ॒',
                  'ஆ॑',
                  'ஆ᳚',

                  'இ॑',
                  'இ॒',

                  'உ॑',
                  'உ॒',
                  'ஊ॒',

                  'எ᳚',
                  'எ॑',
                  'எர்॒',
                  'ஏர்॒',

                  'ஆ॒᳚',
                  'அ॑᳚',

                  'ஒ॒',
                  'ஓ॒',
                  'ஒ॒॑',
                  'ஓ॒॑'
                  ]

NuktaConsonantMap =  [
                     'ஃʼக',
                     'ஃக²',
                     'ஃக³',
                     'ஃஜ',
                     'ஃட³',
                     'ஃட³',
                     'ஃப',
                     'ஃய'
                     ]

IPAVowelSignMap = [
                  '॑',
                  '॒',

                  '᳚',
                  'ா॒',
                  'ா॑',
                  'ா᳚',

                  'ி॑',
                  'ி॒',

                  'ு॑',
                  'ு॒',
                  'ூ॒',

                  'ெ᳚',
                  'ெ॑',
                  'ெர்॒',
                  'ேர்॒',

                  'ா॒᳚',
                  'ா॑᳚',

                  'ொ॒',
                  'ோ॒',
                  'ொ॒॑',
                  'ோ॒॑'
                ]

IPAConsonantMap =[
                     'ட·',
                     'ட²·',
                     'ட³·',
                     'வ·',
                     'வ்ஃப',
                     'த·',
                     'த³·',
                     'ர·',
                     'ஷ·',
                     'ப³·',
                     'ய்ஜ',
                     'ஃய',
                     'ஹ்ர·',
                     'ஹ·',
                     'ஶ·'
                      ]