from .Telugu import *

ModernVowelMap = [
                 'ఆ్య఼',
                 'ఆ॒॑',
                 ]

ModernVowelSignMap =[
                    '్య఼ా',
                    'ా॒॑',
                    ]

IPAVowelMap = [
                  'అ॑',
                  'అ॒',

                  'అ᳚',
                  'ఆ॒',
                  'ఆ॑',
                  'ఆ᳚',

                  'ఇ॑',
                  'ఇ॒',

                  'ఉ॑',
                  'ఉ॒',
                  'ఊ॒',

                  'ఎ᳚',
                  'ఎ॑',
                  'అఽ',
                  'అఽఽ',

                  'ఆ॒᳚',
                  'అ॑᳚',

                  'ఒ॒',
                  'ఓ॒',
                  'ఒ॒॑',
                  'ఓ॒॑'
                  ]

NuktaConsonantMap =  [
                     'క఼',
                     'ఖ఼',
                     'గ఼',
                     'జ఼',
                     'ఢ఼',
                     'ఢ఼',
                     'ఫ఼',
                     'య఼'
                     ]

IPAVowelSignMap = [
                  '॑',
                  '॒',

                  '᳚',
                  'ా॒',
                  'ా॑',
                  'ా᳚',

                  'ి॑',
                  'ి॒',

                  'ు॑',
                  'ు॒',
                  'ూ॒',

                  'ె᳚',
                  'ె॑',
                  'ఽ',
                  'ఽఽ',

                  'ా॒᳚',
                  'ా॑᳚',

                  'ొ॒',
                  'ో॒',
                  'ొ॒॑',
                  'ో॒॑'
                ]

IPAConsonantMap =[
                     'ట఼',
                     'ఠ఼',
                     'డ఼',
                     'వ఼',
                     'వ్ఫ఼',
                     'త఼',
                     'ద఼',
                     'ర఼',
                     'ష఼',
                     'బ఼',
                     'య్జ',
                     'య఼',
                     'హ్ర఼',
                     'హ఼',
                     'శ఼'
                      ]